Revit 2027 API
ExportIFCCategoryInfo.IFCPredefinedType Property
 The name of the predefined type mapped to a particular Revit category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string IFCPredefinedType { get; set; }
Public Property IFCPredefinedType As String
	Get
	Set
public:
property String^ IFCPredefinedType {
	String^ get ();
	void set (String^ value);
}
member IFCPredefinedType : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportIFCCategoryInfo Class
Autodesk.Revit.DB Namespace